# WallSweepWallSubcategoryId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallSweepWallSubcategoryId Property
ParameterTypeId Class See Also
---
"Subcategory of Walls"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallSweepWallSubcategoryId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallSweepWallSubcategoryId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallSweepWallSubcategoryId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace